from statistics import mean
"""

Домашнее задание №1

Цикл for: Продажи товаров

* Дан список словарей с данными по колличеству проданных телефонов
  [
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]}, 
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]},
  ]
* Q1 Посчитать и вывести суммарное количество продаж для каждого товара
* Q2 Посчитать и вывести среднее количество продаж для каждого товара
* Q3 Посчитать и вывести суммарное количество продаж всех товаров
* Q4 Посчитать и вывести среднее количество продаж всех товаров
"""

sale = [
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]}, 
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]},
  ]

summ_sale_phone_all = []

def main():
    """
    Эта функция вызывается автоматически при запуске скрипта в консоли
    В ней надо заменить pass на ваш код
    """
    for phone in sale:
      q1 = sum(phone['items_sold'])
      print(f'Суммарное кол-во продаж: {phone["product"]} - {q1} шт.')
      print(f"Среднее кол-во продаж {phone['product']} - {mean(phone['items_sold'])}")
    
      summ_sale_phone_all.append(sum(phone['items_sold']))
      
      print('---')

if __name__ == "__main__":
    main()

print(f'Общее кол-во продаж: {sum(summ_sale_phone_all)}')
print(f'Среднее кол-во всех продаж: {mean(summ_sale_phone_all)}')